Awis13/seed/seeds/esp32-tembed/src/ui.h
/*
 * ui.h — on-device user interface: rotary encoder + the 320x170 panel
 *
 * Everything this firmware can do was reachable only over HTTP, which is no
 * use standing in front of a television. This is the front panel: the same
 * jobs, started from the knob.
 *
 * Screen state machine
 * --------------------
 *
 *      CLOCK  --click-->  MENU  --+-->  MSGLIST  -->  MSGCARD
 *        ^   \                    |
 *        |    \                   +-->  TVMENU  --+-->  BLAST
 *        |     \                  |               |
 *        |      \                 |               +-->  BRAND  -->  BLAST
 *        |       \                +-->  AP
 *        |        \               +-->  INFO
 *        |         \
 *        |          +--a notification arrives while idle-->  MSGCARD
 *        |
 *        +--15s idle on any screen but a running blast
 *
 * Back leaves a screen for the one above it — MSGCARD to MSGLIST, BRAND to
 * TVMENU, TVMENU to MENU, MENU to CLOCK — whether it comes from the Back item
 * or the user key, so the knob alone is enough to get anywhere and out again.
 *
 * MENU also carries rows that open nothing. Quiet switches the night window on
 * and off, Backlight steps through the levels, and Auto-dim switches the
 * backlight's idle policy; each acts in place and rewrites its own label. They
 * are settings with no arguments, and a screen holding one line of that would
 * be a screen to get out of again.
 *
 * MSGCARD is the one screen where the click and the user key differ. A click
 * acknowledges the message and returns; the user key returns without
 * acknowledging, which is the only way to look at something and deliberately
 * leave it unread. That keeps the user key's meaning — one level up, change
 * nothing — intact everywhere in this file.
 *
 * It is also the one screen where the knob does not move a selection. A body
 * can be longer than the card, so on MSGCARD the knob reads: it scrolls the
 * text, and past the last line it arrives on the reply chips, which are drawn
 * under the text and are where rolling past the text should land. Walking the
 * stack of messages behind the card moved to a long press of the user key,
 * which is a gesture on this screen only. Alone among the knobs in this file
 * this one has end stops, and ui_card_step() says at length why.
 *
 * CLOCK is the home screen and is drawn exactly as before by display_tick();
 * this file does not touch it beyond handing control back. Every other screen
 * returns to CLOCK after UI_IDLE_MS without input, so a device left in a menu
 * on the shelf goes back to being a clock. A running blast is the one screen
 * that does not time out — it is live output, and its click means "stop". An
 * idle timeout never acknowledges anything: a pager that clears itself because
 * nobody was standing there is not a pager.
 *
 * The same timestamp drives a second, slower thing. ui_backlight_idle() hands
 * the elapsed time to skills/backlight.cpp, which takes the panel down to its
 * dimmest preset after BL_IDLE_DIM_MS and out altogether after BL_IDLE_OFF_MS —
 * the backlight is 85mA of a 150mA device, so this is most of what the battery
 * is spent on. Both thresholds live there, next to the policy that compares
 * against them, and are deliberately not repeated here. Any input puts the
 * panel straight back, and the two screens the timeout above exempts are
 * exempted from the dimming too, along with a third the timeout has no reason
 * to care about — see ui_watching_progress().
 *
 * The pager face
 * --------------
 * The references are the Motorola Advisor and Scriptor LX, the Sidekick and
 * the ICQ client, and they contribute three things.
 *
 * From the pagers: an inverse header bar — amber ground, black text — and
 * service text in capitals on a grid that does not move. `MSG 03/12` occupies
 * the same pixels whatever the numbers are, the source column starts at the
 * same x on every row, and the age column is right-aligned to the same edge.
 * Content changing must never make the layout twitch.
 *
 * From the Sidekick: the selection in a list is a thick solid inverse bar, not
 * an outline. It is legible across a room, which an outline is not.
 *
 * From the notion of a card: the message itself is tinted glass rather than a
 * panel. TFT_eSPI::alphaBlend() composites against the black ground, so the
 * fill is the level colour at about a tenth and the border at about four
 * tenths — both genuinely blended, not approximated with a darker constant.
 * The 3px accent bar down the left edge is the only saturated element on the
 * screen, which is what makes it read as the subject.
 *
 * Three colours at a time, never more. The card spends its three on warm
 * white, slate and one level colour; the list spends them on warm white, slate
 * and amber. Black is the ground and does not count.
 *
 * Why this is not a skill
 * -----------------------
 * A Skill in this firmware is an HTTP surface: it is registered in g_skills,
 * its endpoints are listed by /capabilities and its markdown is served by
 * /skill so an agent can drive it. The UI has no endpoints and nothing remote
 * can call it, so registering it would advertise routes that do not exist.
 * It also has to drive TFT_eSPI, and main.cpp owns that — skills deliberately
 * only format strings (see progress_status_line). So it is an include, not a
 * skill.
 *
 * Relationship to the API
 * -----------------------
 * The UI is a second front-end over the same state, never a second copy of it.
 * TV-B-Gone goes through ir_start_tvbgone()/ir_start_code()/ir_stop_job(), the
 * same functions POST /ir/tvbgone and /ir/tvbgone/stop call, the by-brand list
 * is ir_codes[] itself rather than a copy of the names, and the progress screen
 * renders ir_progress() whoever started the job. Opening the menu item while a
 * blast started over HTTP is running shows that blast instead of trying to
 * start a second one. Setup AP calls ap_start(), which is the only way the
 * device raises one after boot.
 *
 * Drawing discipline
 * ------------------
 * fillScreen only on a screen transition. Within a screen every field goes
 * through draw_field(), so a redraw that changes nothing costs no SPI: the
 * live screens are repainted at UI_TICK_MS and a list only when the selection
 * actually moves. Input is polled every loop() pass (~10ms), which is what
 * makes the knob feel attached to the screen.
 *
 * Two things here are animated and both are bounded. The card fades in over
 * three frames, which is three fillRects of one card-sized envelope and then
 * nothing for as long as it stays up. The breathing rule on the clock face is
 * one horizontal line every 80ms and lives in main.cpp. Neither runs unless
 * its screen is in front, and no frame of either calls fillScreen.
 *
 * Scrolling the card is deliberately not a fourth fillRect. A detent repaints
 * the body rows through draw_field and moves one pixel of scrollbar, and it
 * must never raise display_force: on this screen that is what erases the whole
 * envelope and repaints the stack, the tint, the border and the accent bar,
 * which would be a visible flash on every click of the knob.
 *
 * A solid selection bar defeats draw_field's cache — the text of a row does
 * not change when its ground inverts — so the message list repaints the whole
 * row band and forces its cells whenever the selection or the scroll window
 * moves. That is bounded by the screen and happens only on input; between
 * those moments the cache is back in charge and only the age column, which
 * changes on its own, costs anything.
 */

#include <ESP32Encoder.h>

/* ===== Input ===== */

