Awis13/seed/seeds/esp32-tembed/src/ui.h
    int live = 0;
    for (uint8_t i = 0; i < count; i++) if (enabled[i]) live++;
    if (live == 0) return -1;

    bool current_live = current >= 0 && current < count && enabled[current];
    int at = current;
    int remaining = steps % live;
    if (!current_live) {
        at = steps < 0 ? count - 1 : 0;
        while (!enabled[at]) {
            at += steps < 0 ? -1 : 1;
            if (at < 0) at = count - 1;
            if (at >= count) at = 0;
        }
        if (steps > 0) remaining = (steps - 1) % live;
        else if (steps < 0) remaining = (steps + 1) % live;
        else remaining = 0;
    }

    while (remaining != 0) {
        int direction = remaining > 0 ? 1 : -1;
        do {
            at += direction;
            if (at < 0) at = count - 1;
            if (at >= count) at = 0;
        } while (!enabled[at]);
        remaining -= direction;
    }
    return at;
}
/* host-test:end */

/* Top level. The marker on a selected row is also ">", so a submenu is spelled
   out with a trailing one rather than by a different marker. Messages leads
   because it is what this device is for; everything else is a tool it also
   happens to carry. */
enum {
    UI_ITEM_MSG = 0,
    UI_ITEM_QUIET,
    UI_ITEM_BACKLIGHT,
    UI_ITEM_DIM,
    UI_ITEM_TVBGONE,
    UI_ITEM_AP,
    UI_ITEM_INFO,
    UI_ITEM_BACK,
    UI_ITEM_COUNT
};

/* Quiet sits second, under Messages: it is the other thing this device does to
   messages, and it is the row somebody reaches for at one in the morning
   without wanting to read a menu first. The row's name is here; the hours after
   it come from ring_quiet_hours(), because they are the skill's to say — the
   same division as the Messages row and its unread count.

   Backlight sits third, next to Quiet, because the two are the settings a hand
   reaches for in the dark and both act in place rather than opening a screen.
   Same division again: the name is here, the level's word comes from
   bl_level_label().

   Auto-dim sits directly under Backlight because it decides what happens to
   the row above it: whether that level is what the panel holds, or only what
   it holds while somebody is there. Reading the two in that order is the whole
   explanation of the setting, which is why it is not filed under Info. */
static const char *ui_items[UI_ITEM_COUNT] = {
    "Messages >",   /* ui_list_label() appends the unread count */
    "Quiet",        /* ui_list_label() appends the ring's window, or "off" */
    "Backlight",    /* ui_list_label() appends the level's word, or its step */
    "Auto-dim",     /* ui_list_label() appends "on" or "off" */
    "TV-B-Gone >",
    "Setup AP",
    "Info",
    "Back"
};

/* TV-B-Gone. The three blasts are the three regions POST /ir/tvbgone takes;
   By brand opens the named codes. */
enum {
    UI_TV_ALL = 0,
    UI_TV_NA,
    UI_TV_EU,
    UI_TV_BRAND,
    UI_TV_BACK,
    UI_TV_COUNT
};

static const char *ui_tv_items[UI_TV_COUNT] = {
    "Blast all",
    "Blast NA",
    "Blast EU",
    "By brand >",
    "Back"
};

static uint8_t ui_screen = UI_CLOCK;
static int ui_sel = 0;
static int ui_sel_drawn = -1;
/* First list entry on screen: the by-brand list is longer than the panel. */
static int ui_first = 0;
static unsigned long ui_last_input = 0;
static unsigned long ui_last_draw = 0;

/*
 * Somebody is at the device. The one place ui_last_input is written, so that
 * "what counts as input" is a question with a list of callers rather than an
 * assignment scattered across two files.
 *
 * It matters more than it did before the panel could go dark. A screen timeout
 * that fires wrongly costs a trip back into a menu; a blank that fires wrongly
 * costs the owner the screen they are looking at, and every path that puts
 * something on the panel without going through here is a path that draws it
 * into the dark. main.cpp's ap_start() is one such path and calls this; that is
 * the reason it is a named function and not an assignment.
 */
static void ui_note_input() { ui_last_input = millis(); }
/* When the blast being watched stopped running, 0 while it still is. */
static unsigned long ui_blast_done_at = 0;
/* The same, for the recording screen: when the take ended, 0 while it runs. */
static unsigned long ui_rec_done_at = 0;
/* False when the menu could not start a blast and none was already running. */
static bool ui_blast_ok = true;
/* The list the blast was started from, so that finishing goes back to it. */
static uint8_t ui_blast_back = UI_TVMENU;
static int ui_blast_back_sel = 0;

/* Which notification the card is showing. An id, not an index: the list can
   shift underneath it when something expires or a new message arrives. */
static uint32_t ui_msg_id = 0;
/* A panel is identified by its API key, never by its current sorted row. The
   row is only a recovery hint when that key expires or is deleted; 255 is the
   explicit no-selection state and cannot collide with PANEL_MAX. */
static uint8_t ui_panel_sel = UI_PANEL_NONE;
static char ui_panel_key[PANEL_KEY_LEN] = "";
static bool ui_panel_draw_valid = false;
static bool ui_panel_draw_live = false;
static uint8_t ui_panel_draw_font = 0;
static PanelKind ui_panel_draw_kind = PANEL_KIND_TEXT;
static char ui_panel_draw_key[PANEL_KEY_LEN] = "";
/* Fade frames already drawn for the card in front, MSG_FADE_STEPS once done. */
static uint8_t ui_card_fade = 0;
/* Which reply chip the knob is on, for the card in front. Its own variable and
   deliberately not ui_sel: ui_sel is the row in the message list this card was
   opened from, and the card hands it straight back on the way out — a second
   meaning on it would move the list under the user. Meaningless on a message
   that carries no options, which is every message that never gets here. */
static int ui_chip_sel = 0;
/* Scroll window the message list was last drawn with, so that a window that
   moved is recognised as needing the same full repaint a moved selection does. */
static int ui_first_drawn = -1;

#define UI_MENU_Y0   30
#define UI_MENU_DY   32
/* Rows of font 4 at that pitch that fit above the bottom of a 170px panel. */
#define UI_MENU_ROWS 4
#define UI_ROW_COUNT 8

