Awis13/seed/seeds/esp32-tembed/src/ui.h
/*
 * Message list geometry. Font 2 rows on a rigid three-column grid, five of
 * them under an 18px header bar: bars at y-4 for 24px, pitch 28, so the last
 * one ends at 156 on a 170px panel.
 *
 * Every column width below is a budget the renderer ellipsises into, and each
 * was checked against TFT_eSPI's own width tables rather than by eye. In font
 * 2 the widest glyph is 10px ('M' and 'W'), so the guaranteed worst case is 7
 * characters of source, 16 of title and 4 of age — and the measured strings
 * that actually appear are well inside that: "! HOME-RIG" is 69px of the 76
 * the source column has, and the longest age "59m" is 24px of 46.
 */
#define MSG_ROWS      5
#define MSG_ROW_Y0    24
#define MSG_ROW_DY    28
#define MSG_BAR_X      6
#define MSG_BAR_W    308
#define MSG_BAR_UP     4   /* bar top, above the row's text origin */
#define MSG_BAR_H     24
#define MSG_SRC_X     10
#define MSG_SRC_W     76
#define MSG_TITLE_X   92
#define MSG_TITLE_W  160
#define MSG_AGE_R    310   /* right-aligned to this edge */
#define MSG_AGE_W     46

/*
 * Card geometry. 300x100 at (8,28), leaving the header bar above and a hint
 * line below at 140. Text is inset 14px from the left so it clears the 3px
 * accent bar, and 10px from the right, which gives the title 276px — 11
 * characters at the widest glyph font 4 has, and around 18 of ordinary mixed
 * case. The body gets the same 276px, 27 characters worst case in font 2 and
 * around 34 in practice, over as many lines as the band below the title holds.
 */
/* The numbers below are compiled verbatim on the host by tools/test_card.sh,
   which is what turns the line counts into arithmetic something checks. Keep
   every marker line self-closed and on a line of its own, and keep every
   comment inside the region fully closed: the slicer copies from the marker
   without understanding what it copies. */
/* host-test:begin cardgeom — sliced out by tools/test_card.sh */
#define MSG_CARD_X     8
#define MSG_CARD_Y    28
#define MSG_CARD_W   300
#define MSG_CARD_H   100
#define MSG_PAD_L     14
#define MSG_PAD_R     10
#define MSG_ACCENT_W   3
/* Offset of each card peeking out behind. Named MSG_CARD_PEEK rather than the
   obvious MSG_PEEK because lwIP's <sys/socket.h> already owns that name — it
   arrived in this translation unit the day skills/voice.cpp started including
   esp_http_client.h, and the firmware is one translation unit, so a UI layout
   constant and a socket recv() flag were suddenly the same macro. */
#define MSG_CARD_PEEK  3
#define MSG_HINT_Y   140
/* The band under the card is one padded field the width of the card itself.
   The padding is the erase: TFT_eSPI back-fills it with the background, so a
   string that changes length — and the chip row changes length whenever it is
   answered — leaves nothing of the previous one behind. Narrowing this is what
   would produce ghosting, so it is a budget the chip row is fitted into rather
   than a number to tune. Written as the card's width and not as the number that
   happens to be: this region exists so that these stop being literals. */
#define MSG_HINT_W   MSG_CARD_W

/*
 * The card's own rows, as offsets from its top edge.
 *
 * These were bare literals inside ui_draw_card() — y + 7, y + 28, y + 60,
 * y + 78 — which made the one number this screen turns on, how many lines of
 * body a reader gets, something no test could reach and no reader could check
 * without a ruler. They are named here so the count below is arithmetic
 * instead of a claim in a comment.
 *
 * MSG_LINE_H is chr_hgt_f16 from TFT_eSPI's Fonts/Font16.h, which is what
 * fontHeight(2) returns and what setTextPadding erases: the pitch is two
 * pixels more than that, so there is a 2px band between lines that no field's
 * padding ever covers. That band is why the scroll position is a line index
 * and never a pixel offset — see ui_card_line[].
 */
#define MSG_HDR_DY      7   /* source and age */
#define MSG_TITLE_DY   28   /* the title, font 4, 26px tall */
#define MSG_BODY_DY    60   /* first body line, under a title */
#define MSG_BODY_DY_TOP 25  /* first body line when the title is not drawn */
#define MSG_BODY_PITCH 18
#define MSG_LINE_H     16   /* chr_hgt_f16 */
/* The last row inside the card: the border occupies MSG_CARD_H - 1. */
#define MSG_BODY_BOTTOM (MSG_CARD_H - 2)
#define MSG_BODY_W      (MSG_CARD_W - MSG_PAD_L - MSG_PAD_R)

/* Whole lines of MSG_LINE_H at MSG_BODY_PITCH that fit between `dy` and the
   bottom of the card. */
#define MSG_BODY_FIT(dy) \
    ((MSG_BODY_BOTTOM - (dy) + 1 - MSG_LINE_H) / MSG_BODY_PITCH + 1)
/* Two with the title, four without it. The title is what the fourth and third
   lines cost, and ui_draw_card() spends it only on a body that needs them. */
#define MSG_BODY_ROWS     MSG_BODY_FIT(MSG_BODY_DY)
#define MSG_BODY_ROWS_MAX MSG_BODY_FIT(MSG_BODY_DY_TOP)
static_assert(MSG_BODY_ROWS == 2,
              "the short band is no longer two lines — the title rule below "
              "and the tests that pin it are stated in twos");
static_assert(MSG_BODY_ROWS_MAX == 4,
              "the full band is no longer four lines");
static_assert(MSG_BODY_ROWS_MAX > MSG_BODY_ROWS,
              "hiding the title buys no lines, so there is nothing to spend it on");
static_assert(MSG_BODY_DY_TOP >= MSG_HDR_DY + MSG_LINE_H,
              "the first body line would be drawn over the source and age row");

/* Font 2's extreme glyph widths, from TFT_eSPI's Fonts/Font16.c: 3px is the
   punctuation ('!', an apostrophe, a comma, a colon, a semicolon, a bar) and
   10px is 'M' and 'W'. Both are read back out of that table by
   tools/test_card.sh rather than trusted here, because both are load-bearing:
   the narrow one sizes the line cache and the wide one bounds the line count. */
#define MSG_GLYPH_W_MIN 3
#define MSG_GLYPH_W_MAX 10

/*
 * The most lines a body can wrap into, which is what ui_card_line[] is sized
 * for rather than a number chosen to look safe.
 *
 * A line ends either on a space or, for a word wider than the whole line, on
 * the last character that fits — so a line costs at least two bytes ("a ") and
 * a line that cheap forces the next one to be expensive: the space that made it
 * cheap was the LAST one inside the fitting prefix, so the following
 * MSG_BODY_W / MSG_GLYPH_W_MAX - 2 characters carry no space at all and the
 * next line must swallow them. Two consecutive lines therefore cost at least
 * one fitting prefix between them, and the worst case is bounded by two lines
 * per prefix, plus one for the remainder. tools/test_card.sh measures the real
 * worst case against this bound rather than restating it.
 */
#define MSG_BODY_FIT_MIN   (MSG_BODY_W / MSG_GLYPH_W_MAX)
#define MSG_BODY_MAX_LINES (2 * (NOTIFY_BODY_LEN / MSG_BODY_FIT_MIN + 1) + 1)

/* Where the scrollbar goes: one pixel at the card's inner right edge, running
   the height of the body band. Meshtastic puts its thumb at width - 2 of the
   screen it owns; the card is what this owns, so the same two pixels are
   measured off its own right edge instead. */
#define MSG_SCROLL_DX (MSG_CARD_W - 2)
#define MSG_SCROLL_MIN_H 6

/* One drawn body line, as bytes: a full line of the narrowest glyph, plus the
   terminator. It is the pixel budget that decides how much of a body a line
   carries, so it is the pixel budget that sizes the buffer. */
#define MSG_LINE_LEN (MSG_BODY_W / MSG_GLYPH_W_MIN + 1)
/* host-test:end */

/* Arrival: three frames of rising blend plus a few pixels of upward travel.
   40ms a frame, so the whole thing is over in 120ms — present enough to read
   as an arrival, short enough that it never delays the first look. */
#define MSG_FADE_STEPS 3
#define MSG_FADE_MS   40
#define MSG_TINT_A    26   /* card fill: level colour at ~10% over black */
#define MSG_BORDER_A 102   /* card border: the same colour at ~40% */

/* One cache line per drawn row, shared by every screen in this file: only one
   of them is on screen at a time, and entering any screen wipes the panel and
   raises display_force, which makes draw_field ignore whatever the previous
   screen left in here. Wide enough for an ellipsised font 4 title, which is
   the longest string any of them draws — so it is keyed to the title field and
   not to a number, because draw_field compares only the first cache_size - 1
   bytes: a line narrower than what it is asked to hold makes two different
   titles agreeing on that prefix compare equal, and the card then keeps the
   previous message's title on screen. */
#define UI_ROW_LEN   (NOTIFY_TITLE_LEN + 4)
static char ui_row[UI_ROW_COUNT][UI_ROW_LEN];
/* Says the same thing to a reader who pins this back to a number: the four
   bytes are the ellipsis and its terminator, and a line short of that is a
   cache that cannot hold what the widest column draws through it. */
static_assert(sizeof(ui_row[0]) >= NOTIFY_TITLE_LEN + 4,
              "a row cache line is narrower than an ellipsised title");

/* The message list needs its own cache: three cells per row, and it is the one
   screen whose rows are not a single string. Each cell is wide enough for the
   longest string its column can ever be asked to draw — an ellipsised title —
   so that the cache always holds the whole of what is on the panel and two
   different rows can never compare equal.
   Which is the same width, and the same reason, as a row cache line, so it is
   defined from it rather than spelled out again: two names for one expression
   are two places to change and one of them gets missed. */
#define MSG_CELL_LEN UI_ROW_LEN
static char ui_msg_cell[MSG_ROWS][3][MSG_CELL_LEN];

/* The card's body lines get their own cache, one line per drawn row and each
   wide enough for the widest thing a row can hold: MSG_BODY_W pixels of the
   narrowest glyph font 2 has, plus the terminator. Sized to the pixels rather
   than to the body, because it is the pixels that decide how much of the body
   a line carries — and it must not be sized to ui_row[], which is
   UI_ROW_LEN = 69: draw_field compares only cache_size - 1 bytes, so two
   different lines of narrow glyphs agreeing on the first 68 would compare
   equal and the repaint would be skipped, leaving the previous scroll
   position's text on the panel. */
static char ui_card_body[MSG_BODY_ROWS_MAX][MSG_LINE_LEN];
static_assert(MSG_LINE_LEN > MSG_BODY_W / MSG_GLYPH_W_MIN,
              "a body cache line cannot hold a full line of the narrowest glyph");
static_assert(MSG_LINE_LEN > UI_ROW_LEN,
              "a body line is no wider than a row line — check MSG_BODY_W and "
              "the font table before making them share a cache");

/* Home-page panels use the full content width below their title. Short bodies
   keep font 2. A body that needs more rows switches to the fixed 6x8 font 1:
   thirteen 9px-pitch rows fit through the last display pixel and the wrapper's
   worst-case bound is thirteen, so every byte of the 256-byte body remains on
   screen without taking the wheel away from page navigation. */
/* host-test:begin panelrender — sliced out by tools/test_panel_ui.sh */
#define PANEL_TEXT_X             12
#define PANEL_BODY_Y             54
#define PANEL_BODY_BOTTOM       169
#define PANEL_BODY_W            296
#define PANEL_FONT2             2
#define PANEL_FONT2_H          16
#define PANEL_FONT2_PITCH      18
#define PANEL_FONT2_ROWS        6
#define PANEL_FONT1             1
#define PANEL_FONT1_W           6
#define PANEL_FONT1_H           8
#define PANEL_FONT1_PITCH       9
#define PANEL_FONT1_ROWS       13
#define PANEL_BODY_LINE_LEN    (PANEL_BODY_W / MSG_GLYPH_W_MIN + 1)
#define PANEL_FONT2_FIT_MIN    (PANEL_BODY_W / MSG_GLYPH_W_MAX)
#define PANEL_FONT2_MAX_LINES  (2 * (PANEL_BODY_LEN / PANEL_FONT2_FIT_MIN + 1) + 1)
#define PANEL_FONT1_FIT_MIN    (PANEL_BODY_W / PANEL_FONT1_W)
#define PANEL_FONT1_MAX_LINES  (2 * (PANEL_BODY_LEN / PANEL_FONT1_FIT_MIN + 1) + 1)
#define PANEL_WRAP_MAX_LINES   PANEL_FONT2_MAX_LINES
#define PANEL_EMPTY_TITLE_Y     58
#define PANEL_EMPTY_TITLE_H     26
#define PANEL_EMPTY_HINT_Y     102
#define PANEL_EMPTY_HINT_H      16
#define PANEL_GRAPH_X           12
#define PANEL_GRAPH_Y           78
#define PANEL_GRAPH_W          296
#define PANEL_GRAPH_H           88
#define PANEL_BAR_H              7
#define PANEL_STATUS_DETAIL_Y   96
#define PANEL_STATUS_FONT2_ROWS  4
#define PANEL_STATUS_FONT1_ROWS  8
#define PANEL_STATUS_FONT2_MAX_LINES \
    (2 * (PANEL_DETAIL_LEN / PANEL_FONT2_FIT_MIN + 1) + 1)
#define PANEL_STATUS_FONT1_MAX_LINES \
    (2 * (PANEL_DETAIL_LEN / PANEL_FONT1_FIT_MIN + 1) + 1)
#define PANEL_STATUS_WRAP_MAX_LINES PANEL_STATUS_FONT2_MAX_LINES

struct UiPanelLayout {
    uint8_t font;
    uint8_t rows;
    uint8_t pitch;
};

static UiPanelLayout ui_panel_layout(int font2_lines) {
    if (font2_lines <= PANEL_FONT2_ROWS)
        return {PANEL_FONT2, PANEL_FONT2_ROWS, PANEL_FONT2_PITCH};
    return {PANEL_FONT1, PANEL_FONT1_ROWS, PANEL_FONT1_PITCH};
}

static UiPanelLayout ui_panel_status_layout(int font2_lines) {
    if (font2_lines <= PANEL_STATUS_FONT2_ROWS)
        return {PANEL_FONT2, PANEL_STATUS_FONT2_ROWS, PANEL_FONT2_PITCH};
    return {PANEL_FONT1, PANEL_STATUS_FONT1_ROWS, PANEL_FONT1_PITCH};
}

enum {
    UI_PANEL_CLEAR_TITLE_AGE = 1,
    UI_PANEL_CLEAR_BODY = 2,
    UI_PANEL_CLEAR_COUNTER = 4,
    UI_PANEL_CLEAR_CACHES = 8,
    UI_PANEL_CLEAR_ALL = 15
};

