Awis13/seed/seeds/esp32-tembed/src/ui.h
/* A transition invalidates every part of the old panel frame. A same-page
   content update can stay field-differential unless its font changes. */
static uint8_t ui_panel_clear_plan(bool prior_valid, bool prior_live,
                                   bool next_live, bool same_page,
                                   uint8_t prior_font, uint8_t next_font,
                                   PanelKind prior_kind, PanelKind next_kind) {
    if (!prior_valid || prior_live != next_live || !same_page ||
        (next_live && (prior_font != next_font || prior_kind != next_kind)))
        return UI_PANEL_CLEAR_ALL;
    return 0;
}

static bool ui_panel_line_changed(const char *cache, const char *line) {
    return strncmp(cache, line, PANEL_BODY_LINE_LEN - 1) != 0;
}

static int ui_panel_bar_width(float value, float maximum, int width) {
    if (!isfinite(value) || !isfinite(maximum) || maximum <= 0.0f || width <= 0)
        return 0;
    double pixels = (double)value * (double)width / (double)maximum;
    if (pixels <= 0.0) return 0;
    if (pixels >= width) return width;
    return (int)pixels;
}

static int ui_panel_graph_x(uint8_t index, uint8_t count) {
    if (count < 2) return PANEL_GRAPH_X;
    return PANEL_GRAPH_X + ((int)index * (PANEL_GRAPH_W - 1)) / (count - 1);
}

static int ui_panel_graph_y(float value, float minimum, float maximum) {
    if (!isfinite(value) || !isfinite(minimum) || !isfinite(maximum))
        return PANEL_GRAPH_Y + PANEL_GRAPH_H / 2;
    if (maximum <= minimum) return PANEL_GRAPH_Y + PANEL_GRAPH_H / 2;
    double ratio = ((double)value - minimum) / ((double)maximum - minimum);
    if (ratio < 0.0) ratio = 0.0;
    if (ratio > 1.0) ratio = 1.0;
    return PANEL_GRAPH_Y + PANEL_GRAPH_H - 1 -
           (int)(ratio * (PANEL_GRAPH_H - 1));
}

static bool ui_panel_structured_repaint(bool force, uint8_t clear,
                                        bool same_page, PanelKind prior_kind,
                                        PanelKind next_kind) {
    return force || clear != 0 || !same_page || prior_kind != next_kind;
}
/* host-test:end */

static char ui_panel_body[PANEL_FONT1_ROWS][PANEL_BODY_LINE_LEN];
static_assert(sizeof(ui_panel_body[0]) == PANEL_BODY_LINE_LEN,
              "panel body render and cache capacities must stay equal");
static_assert(PANEL_BODY_LINE_LEN > PANEL_BODY_W / MSG_GLYPH_W_MIN,
              "a panel body cache cannot hold the narrowest full line");
static_assert(PANEL_BODY_Y + (PANEL_FONT2_ROWS - 1) * PANEL_FONT2_PITCH +
                  PANEL_FONT2_H - 1 <= PANEL_BODY_BOTTOM,
              "font 2 panel rows cross the display bottom");
static_assert(PANEL_BODY_Y + (PANEL_FONT1_ROWS - 1) * PANEL_FONT1_PITCH +
                  PANEL_FONT1_H - 1 <= PANEL_BODY_BOTTOM,
              "font 1 panel rows cross the display bottom");
static_assert(PANEL_FONT1_MAX_LINES <= PANEL_FONT1_ROWS,
              "font 1 cannot expose the complete maximum panel body");
static_assert(PANEL_STATUS_DETAIL_Y +
                  (PANEL_STATUS_FONT2_ROWS - 1) * PANEL_FONT2_PITCH +
                  PANEL_FONT2_H - 1 <= PANEL_BODY_BOTTOM,
              "font 2 status detail crosses the display bottom");
static_assert(PANEL_STATUS_DETAIL_Y +
                  (PANEL_STATUS_FONT1_ROWS - 1) * PANEL_FONT1_PITCH +
                  PANEL_FONT1_H - 1 <= PANEL_BODY_BOTTOM,
              "font 1 status detail crosses the display bottom");
static_assert(PANEL_STATUS_FONT1_MAX_LINES <= PANEL_STATUS_FONT1_ROWS,
              "font 1 cannot expose the complete maximum status detail");

/* The body itself is not cached as text: it is wrapped once into byte offsets
   into the message, and copied out one line at a time as it is drawn. Offsets
   rather than copies because a 256-byte body can wrap into MSG_BODY_MAX_LINES
   lines, and that many line-sized buffers would be several kilobytes on a
   device with 320 of them. See ui_wrap_lines() and ui_card_line[]. */

static void ui_draw_row(int i, const char *text, int32_t y, uint8_t font,
                        uint16_t color) {
    draw_field(ui_row[i], sizeof(ui_row[i]), text, 12, y, font, color,
               TL_DATUM, 296);
}

/* ===== Fitting text to a column =====
 *
 * Columns are pixel budgets, and what goes in them is whatever an agent put in
 * the JSON. Everything below measures with TFT_eSPI's own tables — the same
 * ones textWidth() reads — so a string is cut where it actually stops fitting
 * rather than at a character count guessed from an average glyph.
 *
 * The fitting helpers and the chip row further down are compiled verbatim on
 * the host by tools/test_chips.sh. Keep every marker line self-closed and on a
 * line of its own, and keep every comment inside a marked region fully closed:
 * the slicer copies from the marker without understanding what it copies.
 */

/* host-test:begin fit — sliced out by tools/test_chips.sh */
static int ui_char_w(char c, uint8_t font) {
    char s[2] = {c, '\0'};
    return tft.textWidth(s, font);
}

/* Copy `src` into `dst`, cut to `max_px` with a trailing ellipsis if it does
   not fit. A column too narrow for the ellipsis itself is hard-truncated
   instead — three dots and nothing else says less than two real characters. */
static void ui_ellipsis(char *dst, size_t n, const char *src, uint8_t font,
                        int max_px) {
    if (n == 0) return;
    dst[0] = '\0';
    if (!src) return;
    if (tft.textWidth(src, font) <= max_px) {
        /* Copied a character at a time rather than with snprintf("%s"): the
           destination is a cache line sized for the widest thing this column
           can display, and spelling the bound out here is what keeps it from
           becoming a second, silent limit the compiler has to warn about. */
        size_t i = 0;
        while (src[i] && i + 1 < n) { dst[i] = src[i]; i++; }
        dst[i] = '\0';
        return;
    }

    int ell = tft.textWidth("...", font);
    bool with_ellipsis = (ell < max_px);
    int budget = with_ellipsis ? max_px - ell : max_px;

    size_t out = 0;
    int acc = 0;
    for (const char *p = src; *p && out + 4 < n; p++) {
        int cw = ui_char_w(*p, font);
        if (acc + cw > budget) break;
        acc += cw;
        dst[out++] = *p;
    }
    /* Hang the ellipsis off a word rather than off a gap. */
    while (out > 0 && dst[out - 1] == ' ') out--;
    dst[out] = '\0';
    if (with_ellipsis) snprintf(dst + out, n - out, "...");
}
/* host-test:end */

/* ===== Wrapping the body over lines =====
 *
 * This replaces a two-line wrap that put an ellipsis on its second line to say
 * "it stops here". It stops nowhere now: the card scrolls, and the scrollbar
 * says where in the body a reader is far better than three dots ever did.
 * ui_ellipsis() is still what cuts the title, the list cells and the chips,
 * which are columns with no second line to continue onto.
 */
/* host-test:begin wrap — sliced out by tools/test_card.sh */
/* One wrapped line, as a place in the body rather than a copy of it. */
struct UiLine {
    uint16_t start;
    uint16_t len;
};

