Awis13/seed/seeds/esp32-tembed/src/ui.h
/*
 * Build the row: the labels, in the order they arrived, with the selected one
 * bracketed and the answered one starred.
 *
 * Every chip pays for both of its wrapper characters whether it is the selected
 * one or not. That gives the chips their gap without a separator that would
 * have to be counted separately, and it keeps the row's width the same
 * wherever the selection sits — exactly one chip is bracketed at a time — so
 * the band is sized once for the widest row a detent can produce. A bracket is
 * two pixels narrower than a space, so the labels either side of the selection
 * do shift by that much as it moves; holding them still would mean a field per
 * chip, four cached strings and four draw_field calls a step, for two pixels.
 *
 * `row_px` is the pixel budget the whole row has to fit in, and it is shared
 * out: each chip gets what is left after the wrappers and the one answered mark
 * are paid for. A label wider than its share is cut with the same trailing
 * ellipsis every other column on this device uses — 15 bytes of label can be
 * wider than a quarter of the row, and a chip that says "ROLLBA..." is a chip
 * you can still ask about, while one clipped mid-glyph is a smear.
 *
 * `sel` and `chosen` outside 0..count-1 simply mark nothing, which is what an
 * unanswered message (chosen = -1) needs and what a card nobody has turned the
 * knob on yet (sel = -1) needs: a row with no bracket anywhere on it says the
 * click would not answer, which on that card it does not. It is also what an
 * index arriving from the store or from a snapshot outside 0..count-1 gets,
 * rather than a read past the labels there are.
 */
static void ui_chip_row(char *dst, size_t n, const NotifyOptions &opts,
                        uint8_t count, int sel, int chosen, int row_px,
                        uint8_t font) {
    if (!dst || n == 0) return;
    dst[0] = '\0';
    if (count == 0) return;
    if (count > NOTIFY_OPT_MAX) count = NOTIFY_OPT_MAX;

    int wrap_px = 2 * ui_char_w(' ', font);
    int budget = (row_px - (int)count * wrap_px - ui_char_w(UI_CHIP_ANSWER, font))
                 / (int)count;
    if (budget < 1) budget = 1;

    size_t out = 0;
    for (int i = 0; i < (int)count; i++) {
        char caps[UI_CHIP_LEN], text[UI_CHIP_LEN];
        char mark[2] = { (i == chosen) ? UI_CHIP_ANSWER : '\0', '\0' };

        ui_caps(caps, sizeof(caps), opts.label[i]);
        ui_ellipsis(text, sizeof(text), caps, font, budget);

        int wrote = snprintf(dst + out, n - out, "%c%s%s%c",
                             (i == sel) ? UI_CHIP_OPEN : ' ', mark, text,
                             (i == sel) ? UI_CHIP_CLOSE : ' ');
        /* The caller's buffer is sized for the worst case this can build, so a
           short one is a mistake elsewhere: stop with whole chips in it rather
           than leave half a label and an unbalanced bracket on the panel. */
        if (wrote < 0 || (size_t)wrote >= n - out) {
            dst[out] = '\0';
            return;
        }
        out += (size_t)wrote;
    }
}

/*
 * The selection the click is allowed to record, given the options the message
 * actually carries.
 *
 * This used to be a stepper as well, and the knob walked the chips through it.
 * The knob is the body's now — see ui_card_step(), which owns every position on
 * this card, chips included — so what is left here is the check that was always
 * the important half: `sel` at or above `count` is a value that did not come
 * from a detent on this row. A `chosen` read back out of the store or out of a
 * snapshot is the way in, and a snapshot is only as trustworthy as the file it
 * came from, so it is clamped rather than handed to notify_choose_id() as an
 * answer to a question with fewer answers than that.
 *
 * A negative `sel` reports the first chip rather than an index, which is why
 * the click path asks ui_chip_answers() whether there is a selection at all
 * before it asks this what the selection is.
 */
static int ui_chip_clamp(int sel, uint8_t count) {
    if (count == 0) return 0;
    if (sel < 0) return 0;
    if (sel >= (int)count) return (int)count - 1;
    return sel;
}

/*
 * Where the knob sits the moment a card opens: on the answer the message
 * already carries, or on nothing at all.
 *
 * Nothing is the answer for a message nobody has replied to, and it is not a
 * detail of the drawing. A card can arrive in front of somebody who never asked
 * for it — ui_poll() opens one on arrival while the device sits on its clock —
 * and the click that comes next has meant "dismiss" on every firmware this
 * device has run. Starting the knob on a chip would file that reflex as a
 * deliberate answer, and by convention the first chip is the one that says yes.
 *
 * `chosen` is bounds-checked against the count rather than only tested for -1,
 * because it arrives from the store and a snapshot is only as trustworthy as
 * the file it came out of: an answer pointing past the labels that are there is
 * no answer, and starting the knob on it would let the click that leaves record
 * it as one.
 *
 * Its own function, rather than one line inside ui_enter_card(), only so that
 * the host suite can reach it — the caller needs the store, the screen state
 * and the encoder, and cannot be sliced. Same reason notify_take_id() is its
 * own function in notify.cpp.
 */
static int ui_chip_start(int chosen, uint8_t count) {
    if (chosen < 0 || chosen >= (int)count) return -1;
    return chosen;
}

/*
 * Does this click record an answer, or is it the plain acknowledge every other
 * card gets?
 *
 * It answers only when the message asks something AND the knob has been turned
 * to one of the chips. Both halves matter and they fail in opposite ways: with
 * no options there is nothing to record, and with options but no selection
 * there is nobody's decision to record — see ui_chip_start() for why a card
 * can be in front of somebody who never chose to open it.
 *
 * Extracted for the same reason as ui_chip_start(), and next to it because the
 * two are one rule in two halves: the click may only answer what an entry to
 * the card, or a detent since, actually selected.
 */
static bool ui_chip_answers(int sel, uint8_t count) {
    return count > 0 && sel >= 0;
}
/* host-test:end */

/* The chip row's own cache, sized by the region above rather than shared with
   ui_row[]: four 15-character labels and their marks are longer than a row
   line, and draw_field compares only the first cache_size-1 bytes — a cache
   shorter than what is on the panel lets two different rows compare equal and
   silently skips the repaint. */
static char ui_card_hint[UI_CHIP_ROW_LEN];

