Awis13/seed/seeds/esp32-tembed/src/ui.h
    uint16_t level = ui_level_color(v.level);

    bool fading = (ui_card_fade < MSG_FADE_STEPS);
    uint8_t step = fading ? (uint8_t)(ui_card_fade + 1) : (uint8_t)MSG_FADE_STEPS;
    int32_t x = MSG_CARD_X;
    int32_t y = MSG_CARD_Y + (MSG_FADE_STEPS - step) * MSG_CARD_PEEK;

    /* Everything the card draws ramps together, so the whole thing arrives as
       one object instead of a border appearing before its contents. */
    uint16_t tint   = tft.alphaBlend((uint8_t)(MSG_TINT_A * step / MSG_FADE_STEPS), level, COL_BG);
    uint16_t edge   = tft.alphaBlend((uint8_t)(MSG_BORDER_A * step / MSG_FADE_STEPS), level, COL_BG);
    uint16_t accent = tft.alphaBlend((uint8_t)(255 * step / MSG_FADE_STEPS), level, COL_BG);
    uint16_t c_pri  = tft.alphaBlend((uint8_t)(255 * step / MSG_FADE_STEPS), COL_TIME, tint);
    uint16_t c_sec  = tft.alphaBlend((uint8_t)(255 * step / MSG_FADE_STEPS), COL_DIM, tint);

    if (fading || display_force) {
        /* Erase the travel envelope — the card's own footprint plus the two
           peeks and the three pixels it still has to rise. 306x112 once per
           fade frame and then never again while this card is up. */
        tft.fillRect(MSG_CARD_X, MSG_CARD_Y, MSG_CARD_W + 2 * MSG_CARD_PEEK,
                     MSG_CARD_H + 4 * MSG_CARD_PEEK, COL_BG);

        /* Two more cards behind, when there are two more to be behind: the
           stack a long press of the user key walks. Outlines only, dimmer with
           depth. */
        if (total > 1) {
            for (int p = 2; p >= 1; p--) {
                uint8_t a = (uint8_t)(MSG_BORDER_A / (p + 1) * step / MSG_FADE_STEPS);
                tft.drawRect(x + p * MSG_CARD_PEEK, y + p * MSG_CARD_PEEK,
                             MSG_CARD_W, MSG_CARD_H,
                             tft.alphaBlend(a, level, COL_BG));
            }
        }

        tft.fillRect(x, y, MSG_CARD_W, MSG_CARD_H, tint);
        tft.drawRect(x, y, MSG_CARD_W, MSG_CARD_H, edge);
        tft.fillRect(x, y, MSG_ACCENT_W, MSG_CARD_H, accent);
        display_force = true;  /* the fill took the text with it */
    }

    int32_t tx = x + MSG_PAD_L;
    int32_t rx = x + MSG_CARD_W - MSG_PAD_R;

    /* Every column below is MSG_BODY_W, written out by that name each time
       rather than through a local: it is the same budget ui_card_wrap()
       measured the body against, and a local would be a second name for it —
       which is exactly what one of them being changed and the other not looks
       like. */
    char caps[NOTIFY_SOURCE_LEN], src[NOTIFY_SOURCE_LEN], age[16];
    ui_caps(caps, sizeof(caps), v.source[0] ? v.source : "device");
    ui_ellipsis(src, sizeof(src), caps, 2, MSG_BODY_W - MSG_AGE_W - 8);
    notify_age_str(v.age_s, age, sizeof(age));
    draw_field(ui_row[0], sizeof(ui_row[0]), src, tx, y + MSG_HDR_DY, 2,
               c_sec, TL_DATUM, (uint16_t)(MSG_BODY_W - MSG_AGE_W - 8), tint);
    draw_field(ui_row[1], sizeof(ui_row[1]), age, rx, y + MSG_HDR_DY, 2,
               c_sec, TR_DATUM, MSG_AGE_W, tint);

    /* Keyed to the field, like the row cache it is drawn through: at the
       narrowest glyphs font 4 has, about fifty-five characters cross this
       column, so a fixed buffer sized for the old title would cut the card's
       title before the pixels did. The card geometry note above counts the
       same 276px the other way — 11 characters at the widest glyph and around
       18 of ordinary mixed case — because that is what a reader gets; a buffer
       has to survive the narrowest.
       Two asserts, because the two directions fail differently and both fail
       quietly. Wider than the cache is the aliasing one: draw_field compares
       only the first cache_size - 1 bytes, so a string wider than the cache it
       is drawn through makes two different titles compare equal and leaves the
       previous message's title on the card. Narrower than the field is the
       hardcoded 48 this buffer stopped being — a second, quieter cut ahead of
       the pixels — so it is pinned from below as well.
       Both are about the buffer declared below and not about UI_ROW_LEN, which
       the assert beside ui_row[] already pins. They read as a restatement of it
       only for as long as this buffer is declared from the same macro: write
       `char title[64]` here and the lower of the two is the one that fails, and
       nothing else in the file would. */
    if (ui_card_titled) {
        char title[UI_ROW_LEN];
        static_assert(sizeof(title) <= sizeof(ui_row[0]),
                      "the card title is wider than the cache it is compared in");
        static_assert(sizeof(title) >= NOTIFY_TITLE_LEN + 4,
                      "the card title is narrower than an ellipsised title");
        ui_ellipsis(title, sizeof(title), v.title, 4, MSG_BODY_W);
        draw_field(ui_row[2], sizeof(ui_row[2]), title, tx, y + MSG_TITLE_DY, 4,
                   c_pri, TL_DATUM, (uint16_t)MSG_BODY_W, tint);
    }

    /*
     * The body: as many lines as the band holds, starting at the one the knob
     * has scrolled to.
     *
     * A moved scroll position changes what every row says, and the way to make
     * draw_field notice is emphatically NOT display_force — on this screen that
     * is the second half of the branch above, and raising it would re-erase the
     * whole envelope and repaint the stack, the tint, the border and the accent
     * bar on every single detent. The caches are dropped instead; see
     * ui_cache_drop() for why they are poisoned rather than emptied.
     */
    int32_t body_y = y + (ui_card_titled ? MSG_BODY_DY : MSG_BODY_DY_TOP);
    int rows = ui_card_rows();

    if (ui_card_first != ui_card_first_drawn) {
        for (int r = 0; r < MSG_BODY_ROWS_MAX; r++) ui_cache_drop(ui_card_body[r]);
        ui_card_first_drawn = ui_card_first;
    }

    for (int r = 0; r < rows; r++) {
        char line[MSG_LINE_LEN];
        static_assert(sizeof(line) == sizeof(ui_card_body[0]),
                      "a body line is not the size of the cache it is compared "
                      "in — draw_field only compares cache_size - 1 bytes, so "
                      "the wider of the two aliases silently");
        int i = ui_card_first + r;
        line[0] = '\0';
        if (i < ui_card_lines) ui_line_text(line, sizeof(line), v.body, ui_card_line[i]);
        draw_field(ui_card_body[r], sizeof(ui_card_body[r]), line, tx,
                   body_y + r * MSG_BODY_PITCH, 2, c_sec, TL_DATUM,
                   (uint16_t)MSG_BODY_W, tint);
    }

