Awis13/seed/seeds/esp32-tembed/src/ui.h
    snprintf(buf, sizeof(buf), "HEAP   %lu KB",
             (unsigned long)(ESP.getFreeHeap() / 1024));
    ui_draw_row(row, buf, y0 + dy * row, 2, COL_DIM); row++;

    if (hw.has_cc1101) {
        snprintf(buf, sizeof(buf), "CC1101 yes (ver 0x%02X)", hw.cc1101_version);
    } else {
        snprintf(buf, sizeof(buf), "CC1101 not detected");
    }
    ui_draw_row(row, buf, y0 + dy * row, 2, COL_DIM); row++;

    ui_draw_row(row, "click to go back", y0 + dy * row, 2, COL_DIM);
    display_force = false;
}

/* ===== Recording =====
 *
 * The one screen that comes up without anybody asking for it: mic.cpp decides
 * a recording has started, ui_poll() notices and puts this in front. It is
 * live output, like a running blast, so the idle timeout does not apply to it
 * — a screen that vanished fifteen seconds into a hold would be exactly wrong.
 *
 * Two things are on it. The elapsed time, which comes from bytes captured
 * rather than from the clock, so it stops moving if the samples stop arriving
 * instead of counting up over audio that does not exist. And a level meter,
 * which is the only feedback that says the microphone is hearing anything at
 * all — without it a dead microphone and a quiet room look identical while you
 * are standing there talking into it.
 */
#define REC_BAR_X    12
#define REC_BAR_Y    86
#define REC_BAR_W   296
#define REC_BAR_H    24
/* The fill is quantised to this many pixels before it is compared against what
   is already on the panel. Room noise moves a peak meter constantly, and
   without a step every tick would repaint the bar for a pixel nobody can see. */
#define REC_BAR_STEP  8

/* How long the finished take stays on screen before the clock comes back.
   Longer than a blast's UI_RESULT_MS, because this result is a number to read
   — the peak — rather than a word to glance at. */
#define UI_REC_RESULT_MS 2500

static int ui_rec_bar_drawn = -1;
/* The colour that width was drawn in. Compared as well as the width, because
   the bar changes colour when the take ends — and if the last live level
   happened to quantise to the same width as the take's peak, comparing width
   alone would leave the finished take showing the recording's red. */
static uint16_t ui_rec_bar_color = 0;

static void ui_draw_rec_bar(int pct, uint16_t color) {
    if (pct < 0) pct = 0;
    if (pct > 100) pct = 100;
    int w = (REC_BAR_W * pct) / 100;
    w = (w / REC_BAR_STEP) * REC_BAR_STEP;
    if (color != ui_rec_bar_color) ui_rec_bar_drawn = -1;
    ui_rec_bar_color = color;
    if (w == ui_rec_bar_drawn) return;

    /* Only the pixels that changed: the fill grows or the trough takes back
       what it lost. Repainting the whole bar every step would be 296x24 of SPI
       traffic on a pass that is already sharing the loop with the capture. */
    if (w > ui_rec_bar_drawn) {
        int from = (ui_rec_bar_drawn < 0) ? 0 : ui_rec_bar_drawn;
        tft.fillRect(REC_BAR_X + from, REC_BAR_Y, w - from, REC_BAR_H, color);
        if (ui_rec_bar_drawn < 0)
            tft.fillRect(REC_BAR_X + w, REC_BAR_Y, REC_BAR_W - w, REC_BAR_H, COL_RULE);
    } else {
        tft.fillRect(REC_BAR_X + w, REC_BAR_Y, ui_rec_bar_drawn - w, REC_BAR_H, COL_RULE);
    }
    ui_rec_bar_drawn = w;
}

/* Seconds to one decimal, which is the resolution a hand on a button can
   actually aim at. The layout does not move as the number grows: the string is
   always the same shape. */
static void ui_rec_secs(char *out, size_t n, uint32_t ms) {
    snprintf(out, n, "%lu.%lus", (unsigned long)(ms / 1000),
             (unsigned long)((ms % 1000) / 100));
}

static void ui_draw_rec() {
    char buf[40];
    char secs[16];
    bool rec = mic_is_recording();

    /* The wipe on the way in took the bar with it. */
    if (display_force) ui_rec_bar_drawn = -1;

    if (rec) {
        ui_rec_secs(secs, sizeof(secs), mic_elapsed_ms());
        snprintf(buf, sizeof(buf), "REC  %s", secs);
        ui_draw_row(0, buf, 40, 4, COL_CRIT);
        /* Reset-on-read: this is the level meter's own peak and nothing else
           may sample it, or the meter would show whatever was left over from
           the last reader. */
        ui_draw_rec_bar(mic_level_pct(), COL_ACCENT);
        ui_draw_row(2, "", 120, 2, COL_DIM);
        ui_draw_row(3, "release the knob to stop", 148, 2, COL_DIM);
    } else {
        uint32_t ms = mic_last_take_ms();
        int32_t peak = mic_last_take_peak();
        ui_rec_secs(secs, sizeof(secs), ms);
        snprintf(buf, sizeof(buf), "%s recorded", secs);
        ui_draw_row(0, buf, 40, 4, COL_TIME);
        /* The take's own peak, held still. A bar that drops to nothing the
           moment the button comes up would say "silent" about a recording that
           was not. */
        ui_draw_rec_bar((int)((peak * 100) / 32767), COL_DIM);
        if (ms == 0) {
            snprintf(buf, sizeof(buf), "nothing captured");
        } else if (peak == 0) {
            /* ASCII only, here and on every other string this file draws: the
               TFT_eSPI fonts compiled in cover 32-126, and a multi-byte dash
               would render as two pieces of garbage rather than as a dash. */
            snprintf(buf, sizeof(buf), "silent, peak 0");
        } else {
            snprintf(buf, sizeof(buf), "peak %ld / 32767", (long)peak);
        }
        ui_draw_row(2, buf, 120, 2, COL_DIM);
        ui_draw_row(3, "GET /mic/last to hear it", 148, 2, COL_DIM);
    }
    display_force = false;
}

/* Resolve the selected key in a coherent sorted snapshot, then apply the
   detents. If the key disappeared, its last row is the recovery point: the
   item that shifted into that row remains selected, while deletion of the last
   row falls back to the new last row. Reordering alone never changes pages. */
static int ui_panel_select(const Panel *panels, int count, int steps) {
    if (!panels || count <= 0) {
        ui_panel_sel = UI_PANEL_NONE;
        ui_panel_key[0] = '\0';
        return -1;
    }

    int current = -1;
    if (ui_panel_key[0]) {
        for (int i = 0; i < count; i++) {
            if (strcmp(panels[i].key, ui_panel_key) == 0) {
                current = i;
                break;
            }
        }
    }
    if (current < 0 && ui_panel_sel != UI_PANEL_NONE) {
        current = ui_panel_sel < count ? ui_panel_sel : count - 1;
    }

    bool enabled[PANEL_MAX] = {};
    for (int i = 0; i < count; i++) enabled[i] = true;
    int selected = ui_panel_next(enabled, (uint8_t)count, current, steps);
    if (selected < 0) {
        ui_panel_sel = UI_PANEL_NONE;
        ui_panel_key[0] = '\0';
        return -1;
    }

    ui_panel_sel = (uint8_t)selected;
    snprintf(ui_panel_key, sizeof(ui_panel_key), "%s", panels[selected].key);
    return selected;
}

static void ui_panel_move(int steps) {
    Panel panels[PANEL_MAX];
    uint64_t sampled_ms;
    int count = panel_live_snapshot(panels, &sampled_ms);
    (void)sampled_ms;
    ui_panel_select(panels, count, steps);
}

