Awis13/seed/seeds/esp32-tembed/src/ui.h
static void ui_panel_clear(uint8_t plan) {
    if (plan & (UI_PANEL_CLEAR_TITLE_AGE | UI_PANEL_CLEAR_BODY)) {
        tft.fillRect(0, HDR_BAR_H, tft.width(), tft.height() - HDR_BAR_H, COL_BG);
    }
    if (plan & UI_PANEL_CLEAR_COUNTER) {
        tft.fillRect(tft.width() - 64, 0, 64, HDR_BAR_H, COL_ACCENT);
    }
    if (plan & UI_PANEL_CLEAR_CACHES) {
        ui_cache_drop(ui_row[0]);
        ui_cache_drop(ui_row[1]);
        ui_cache_drop(ui_row[2]);
        for (int r = 0; r < PANEL_FONT1_ROWS; r++) ui_cache_drop(ui_panel_body[r]);
    }
}

static void ui_panel_draw_state(bool live, const char *key, uint8_t font,
                                PanelKind kind) {
    ui_panel_draw_valid = true;
    ui_panel_draw_live = live;
    ui_panel_draw_font = font;
    ui_panel_draw_kind = kind;
    snprintf(ui_panel_draw_key, sizeof(ui_panel_draw_key), "%s", key ? key : "");
}

static void ui_panel_direct_text(const char *text, int x, int y, uint8_t font,
                                 uint16_t color, uint8_t datum) {
    tft.setTextDatum(datum);
    tft.setTextColor(color, COL_BG);
    tft.drawString(text, x, y, font);
}

static void ui_panel_draw_kv(const PanelKvPayload &kv) {
    for (uint8_t i = 0; i < kv.count && i < PANEL_KV_MAX; i++) {
        char label[PANEL_LABEL_LEN + 4];
        char value[PANEL_VALUE_LEN + 4];
        ui_ellipsis(label, sizeof(label), kv.items[i].label, 2, 126);
        ui_ellipsis(value, sizeof(value), kv.items[i].value, 2, 154);
        int y = PANEL_BODY_Y + i * 22;
        ui_panel_direct_text(label, PANEL_TEXT_X, y, 2, COL_DIM, TL_DATUM);
        ui_panel_direct_text(value, PANEL_TEXT_X + PANEL_BODY_W, y, 2,
                             COL_TIME, TR_DATUM);
    }
}

static void ui_panel_draw_bars(const PanelBarsPayload &bars) {
    for (uint8_t i = 0; i < bars.count && i < PANEL_BAR_MAX; i++) {
        const PanelBarItem &bar = bars.items[i];
        char label[PANEL_LABEL_LEN + 4];
        char amount[32];
        ui_ellipsis(label, sizeof(label), bar.label, 2, 150);
        snprintf(amount, sizeof(amount), "%.5g%s", (double)bar.value, bar.unit);
        int text_y = PANEL_BODY_Y + i * 28;
        int bar_y = text_y + 18;
        ui_panel_direct_text(label, PANEL_TEXT_X, text_y, 2, COL_DIM, TL_DATUM);
        ui_panel_direct_text(amount, PANEL_TEXT_X + PANEL_BODY_W, text_y, 2,
                             COL_TIME, TR_DATUM);
        tft.fillRect(PANEL_TEXT_X, bar_y, PANEL_BODY_W, PANEL_BAR_H, COL_RULE);
        int filled = ui_panel_bar_width(bar.value, bar.max, PANEL_BODY_W);
        if (filled > 0)
            tft.fillRect(PANEL_TEXT_X, bar_y, filled, PANEL_BAR_H, COL_ACCENT);
    }
}

static void ui_panel_draw_sparkline(const PanelSparkPayload &sparkline) {
    if (sparkline.count < 2 || sparkline.count > PANEL_SPARK_MAX) return;
    float minimum = sparkline.values[0];
    float maximum = sparkline.values[0];
    for (uint8_t i = 1; i < sparkline.count; i++) {
        if (sparkline.values[i] < minimum) minimum = sparkline.values[i];
        if (sparkline.values[i] > maximum) maximum = sparkline.values[i];
    }
    char current[40];
    snprintf(current, sizeof(current), "%.7g%s", (double)sparkline.values[sparkline.count - 1],
             sparkline.unit);
    ui_panel_direct_text(current, PANEL_TEXT_X, PANEL_BODY_Y, 2, COL_TIME, TL_DATUM);
    int prior_x = ui_panel_graph_x(0, sparkline.count);
    int prior_y = ui_panel_graph_y(sparkline.values[0], minimum, maximum);
    for (uint8_t i = 1; i < sparkline.count; i++) {
        int x = ui_panel_graph_x(i, sparkline.count);
        int y = ui_panel_graph_y(sparkline.values[i], minimum, maximum);
        tft.drawLine(prior_x, prior_y, x, y, COL_ACCENT);
        prior_x = x;
        prior_y = y;
    }
}

static void ui_panel_draw_status(const PanelStatusPayload &status) {
    char headline[PANEL_STATUS_LEN + PANEL_UNIT_LEN + 2];
    snprintf(headline, sizeof(headline), "%s%s%s", status.value,
             status.unit[0] ? " " : "", status.unit);
    char fitted[sizeof(headline) + 4];
    ui_ellipsis(fitted, sizeof(fitted), headline, 4, PANEL_BODY_W);
    ui_panel_direct_text(fitted, PANEL_TEXT_X + PANEL_BODY_W / 2, PANEL_BODY_Y + 4,
                         4, COL_TIME, TC_DATUM);

    UiLine lines[PANEL_STATUS_WRAP_MAX_LINES];
    int count = ui_wrap_lines(status.detail, lines, PANEL_STATUS_WRAP_MAX_LINES,
                              PANEL_FONT2, PANEL_BODY_W);
    UiPanelLayout layout = ui_panel_status_layout(count);
    if (layout.font == PANEL_FONT1) {
        count = ui_wrap_lines(status.detail, lines, PANEL_STATUS_WRAP_MAX_LINES,
                              PANEL_FONT1, PANEL_BODY_W);
    }
    for (int i = 0; i < count; i++) {
        char line[PANEL_BODY_LINE_LEN];
        ui_line_text(line, sizeof(line), status.detail, lines[i]);
        ui_panel_direct_text(line, PANEL_TEXT_X,
                             PANEL_STATUS_DETAIL_Y + i * layout.pitch,
                             layout.font, COL_DIM, TL_DATUM);
    }
}

static void ui_panel_draw_structured(const Panel &panel) {
    tft.fillRect(PANEL_TEXT_X, PANEL_BODY_Y, PANEL_BODY_W,
                 PANEL_BODY_BOTTOM - PANEL_BODY_Y + 1, COL_BG);
    switch (panel.kind) {
        case PANEL_KIND_KV:        ui_panel_draw_kv(panel.payload.kv); break;
        case PANEL_KIND_BARS:      ui_panel_draw_bars(panel.payload.bars); break;
        case PANEL_KIND_SPARKLINE: ui_panel_draw_sparkline(panel.payload.sparkline); break;
        case PANEL_KIND_STATUS:    ui_panel_draw_status(panel.payload.status); break;
        default:
            ui_panel_direct_text("INVALID PANEL", PANEL_TEXT_X + PANEL_BODY_W / 2,
                                 96, 4, COL_CRIT, MC_DATUM);
            break;
    }
}

static void ui_draw_panel() {
    Panel panels[PANEL_MAX];
    uint64_t sampled_ms;
    int count = panel_live_snapshot(panels, &sampled_ms);
    int selected = ui_panel_select(panels, count, 0);

    if (selected < 0) {
        bool same_page = ui_panel_draw_valid && !ui_panel_draw_live;
        uint8_t clear = ui_panel_clear_plan(
            ui_panel_draw_valid, ui_panel_draw_live, false, same_page,
            ui_panel_draw_font, 0, ui_panel_draw_kind, PANEL_KIND_TEXT);
        ui_panel_clear(clear);
        ui_draw_row(0, "NO PANELS", PANEL_EMPTY_TITLE_Y, 4, COL_TIME);
        ui_draw_row(1, "POST /panel to add one", PANEL_EMPTY_HINT_Y, 2, COL_DIM);
        ui_panel_draw_state(false, "", 0, PANEL_KIND_TEXT);
        display_force = false;
        return;
    }

