Awis13/seed/seeds/esp32-tembed/src/ui.h
    const Panel &panel = panels[selected];
    UiLine lines[PANEL_WRAP_MAX_LINES] = {};
    int line_count = 0;
    UiPanelLayout layout = {0, 0, 0};
    if (panel.kind == PANEL_KIND_TEXT) {
        line_count = ui_wrap_lines(panel.payload.body, lines, PANEL_WRAP_MAX_LINES,
                                   PANEL_FONT2, PANEL_BODY_W);
        layout = ui_panel_layout(line_count);
        if (layout.font == PANEL_FONT1) {
            line_count = ui_wrap_lines(panel.payload.body, lines,
                                       PANEL_WRAP_MAX_LINES, PANEL_FONT1,
                                       PANEL_BODY_W);
        }
    }

    bool same_page = ui_panel_draw_valid && ui_panel_draw_live &&
                     strcmp(ui_panel_draw_key, panel.key) == 0;
    uint8_t clear = ui_panel_clear_plan(
        ui_panel_draw_valid, ui_panel_draw_live, true, same_page,
        ui_panel_draw_font, layout.font, ui_panel_draw_kind, panel.kind);
    ui_panel_clear(clear);

    char title[UI_ROW_LEN];
    ui_ellipsis(title, sizeof(title), panel.title[0] ? panel.title : panel.key,
                4, 238);
    draw_field(ui_row[0], sizeof(ui_row[0]), title, PANEL_TEXT_X, 24, 4,
               COL_TIME, TL_DATUM, 238);

    uint64_t age_ms = panel_age(panel, sampled_ms);
    uint64_t age_seconds = age_ms / 1000ULL;
    unsigned long age_s = age_seconds > UINT32_MAX
                              ? (unsigned long)UINT32_MAX
                              : (unsigned long)age_seconds;
    char age[8];
    notify_age_str(age_s, age, sizeof(age));
    draw_field(ui_row[1], sizeof(ui_row[1]), age, tft.width() - 10, 29, 2,
               COL_DIM, TR_DATUM, 48);

    char counter[8];
    uint8_t total = (uint8_t)count;
    snprintf(counter, sizeof(counter), "%u/%u", (unsigned)ui_panel_sel + 1U,
             (unsigned)total);
    draw_field(ui_row[2], sizeof(ui_row[2]), counter, tft.width() - 10, HDR_Y,
               2, COL_BG, TR_DATUM, 48, COL_ACCENT);

    if (panel.kind == PANEL_KIND_TEXT) {
        for (int r = 0; r < layout.rows; r++) {
            char line[PANEL_BODY_LINE_LEN];
            if (r < line_count)
                ui_line_text(line, sizeof(line), panel.payload.body, lines[r]);
            else line[0] = '\0';
            if (display_force || ui_panel_line_changed(ui_panel_body[r], line)) {
                draw_field(ui_panel_body[r], sizeof(ui_panel_body[r]), line,
                           PANEL_TEXT_X, PANEL_BODY_Y + r * layout.pitch, layout.font,
                           COL_TIME, TL_DATUM, PANEL_BODY_W);
            }
        }
    } else if (ui_panel_structured_repaint(display_force, clear, same_page,
                                           ui_panel_draw_kind, panel.kind)) {
        ui_panel_draw_structured(panel);
    }
    ui_panel_draw_state(true, panel.key, layout.font, panel.kind);
    display_force = false;
}

/* Screens whose content can only change when the knob moves, and which
   therefore have nothing to gain from the periodic repaint. The message list
   is deliberately not one of them: its age column advances on its own. */
static bool ui_input_driven(uint8_t screen) {
    return screen == UI_MENU || screen == UI_TVMENU || screen == UI_BRAND;
}

static void ui_draw() {
    switch (ui_screen) {
        case UI_MENU:
        case UI_TVMENU:
        case UI_BRAND:   ui_draw_list();    break;
        case UI_MSGLIST: ui_draw_msglist(); break;
        case UI_MSGCARD: ui_draw_card();    break;
        case UI_BLAST:   ui_draw_blast();   break;
        case UI_AP:      ui_draw_ap();      break;
        case UI_INFO:    ui_draw_info();    break;
        case UI_REC:     ui_draw_rec();     break;
        case UI_PANEL:   ui_draw_panel();   break;
        default: break;
    }
}

/* The only place a screen changes, and the only place fillScreen is called
   outside display_status(). */
static void ui_enter(uint8_t screen) {
    ui_screen = screen;
    /* A screen change is input, including the ones nobody pressed for: a card
       arriving and a recording taking the panel both land here, and both put
       something on a screen that has to be lit to be worth putting it on. */
    ui_note_input();
    ui_last_draw = millis();
    ui_encoder_reset();

    /* Tell the ring what is on the panel, the same way loop() tells it which
       job is on the bar: the UI hands over a fact, and skills/ring.cpp decides
       on its own what to do with it.
       This is the only place a screen changes, which is exactly why the telling
       is here. Every way out of a card passes through it — the click that
       acknowledges the message, the user key, the idle timeout, the message
       expiring underneath the card — so the ring cannot be left naming a
       message nobody is looking at by a new exit path somebody forgets to
       update. The lookup can fail on a card whose message went away between the
       decision to show it and this line, and that is a card about to be closed
       on the next pass; the ring says nothing for it in the meantime.
       No host test covers these six lines and none can: they are a call into a
       driver from a function that draws. What IS covered is everything they
       feed — progress_ring_phase() by tools/test_progress.sh and the exclusion
       of the card's own message by tools/test_notify_options.sh — so the part
       left to inspection is that this sits in ui_enter() and nowhere else. */
    if (screen == UI_MSGCARD) {
        NotifyView v;
        if (notify_view_by_id(ui_msg_id, v, NULL, NULL)) ring_card_set(v.id, v.level);
        else ring_card_clear();
    } else {
        ring_card_clear();
    }

    if (screen == UI_CLOCK) {
        display_status();  /* repaints the clock chrome and every clock field */
        /* The link may have come or gone while the menu was up. This repaint
           already reflects it, so record it rather than let loop() spend a
           second fillScreen on the same news. */
        clock_last_status = WiFi.status();
        return;
    }

