Awis13/seed/seeds/esp32-tembed/src/ui.h
    tft.fillScreen(COL_BG);
    tft.setTextPadding(0);
    tft.setTextDatum(TL_DATUM);
    /* Inverse header bar: amber ground, black text, the way the Advisor's LCD
       did it. It replaces the hairline rule — the bar is its own separator —
       and it is what every screen under the knob has in common. The clock face
       keeps the plain header and the rule, because that face is the one thing
       here nobody asked to be louder. */
    tft.fillRect(0, 0, tft.width(), HDR_BAR_H, COL_ACCENT);
    tft.setTextColor(COL_BG, COL_ACCENT);
    tft.drawString(ui_titles[screen], 8, HDR_Y, 2);

    display_force = true;  /* the wipe took every cached field with it */
    ui_sel_drawn = -1;
    ui_first_drawn = -1;
    ui_draw();
}

/* Entering a list places the selection as well as the screen: ui_sel is shared
   by all three, so a brand index left over from one would be out of range in
   another. Callers use it to land on the item that leads back where they came
   from. */
static void ui_enter_list(uint8_t screen, int sel) {
    ui_sel = sel;
    ui_first = 0;
    ui_enter(screen);
}

/* Watch a job the list just asked for. `job` is 0 when nothing started, which
   is either a blast already in flight — watched rather than restarted — or a
   transmitter that is not there. */
static void ui_enter_blast(uint16_t job, int back_sel) {
    ui_blast_ok = (job != 0) || ir_busy();
    ui_blast_done_at = 0;
    ui_blast_back = ui_screen;
    ui_blast_back_sel = back_sel;
    if (job != 0) event_add("ir: job %u started from the menu", (unsigned)job);
    ui_enter(UI_BLAST);
}

/* Open one message. The card holds the id rather than the row, so that a
   message arriving or expiring while it is up cannot silently swap it for a
   different one. */
static void ui_enter_card(uint32_t id) {
    NotifyView v;

    ui_msg_id = id;
    ui_card_fade = 0;
    /* Where the knob starts is ui_chip_start()'s decision and only its, so that
       the host suite can hold it to account: an already-answered message opens
       on its own answer, so the click that leaves the card cannot quietly
       change it, and an unanswered one opens on nothing, so that same click
       stays the dismissal it has always been. notify_view_by_id() is the lookup
       ui_draw_card() draws with and stops at the same first id match, so the
       chip the knob starts on is the chip drawn starred. No entry to read is
       nothing to answer, which is the same nothing. */
    ui_chip_sel = notify_view_by_id(id, v, NULL, NULL)
                      ? ui_chip_start(v.chosen, v.opt_count)
                      : -1;
    /* A new card is a new body: drop the wrap, the scroll position and the
       thumb together, in the one place the card's identity changes. The fade
       that follows repaints the whole card, which is what erases the previous
       thumb from the panel — hence the drawn state going back to "nothing
       drawn" rather than to a position. */
    ui_card_wrapped = 0;
    ui_card_first = 0;
    ui_card_first_drawn = -1;
    ui_card_thumb_y = -1;
    ui_card_thumb_h = -1;
    ui_enter(UI_MSGCARD);
}

static void ui_activate(int item) {
    if (ui_screen == UI_MSGLIST) {
        int items = notify_count();
        if (item < items) {
            NotifyView v;
            if (notify_view(item, v)) ui_enter_card(v.id);
        } else {
            ui_enter_list(UI_MENU, UI_ITEM_MSG);
        }
        return;
    }

    if (ui_screen == UI_BRAND) {
        /* One named code, repeat 1 — which still means three frames for a Sony
           entry, because that is what SIRC needs. This is the point of the
           screen: the codes are power toggles, so blasting a set that holds
           several a television answers to turns it off, on and off again. */
        if (item < ir_code_count) ui_enter_blast(ir_start_code(item, 1), item);
        else ui_enter_list(UI_TVMENU, UI_TV_BRAND);
        return;
    }

    if (ui_screen == UI_TVMENU) {
        switch (item) {
            /* Repeat 1, the same default POST /ir/tvbgone applies to a
               body-less request. */
            case UI_TV_ALL: ui_enter_blast(ir_start_tvbgone(IR_REGION_ALL, 1), item); break;
            case UI_TV_NA:  ui_enter_blast(ir_start_tvbgone(IR_REGION_NA, 1), item);  break;
            case UI_TV_EU:  ui_enter_blast(ir_start_tvbgone(IR_REGION_EU, 1), item);  break;
            case UI_TV_BRAND: ui_enter_list(UI_BRAND, 0); break;
            default: ui_enter_list(UI_MENU, UI_ITEM_TVBGONE); break;
        }
        return;
    }

    switch (item) {
        case UI_ITEM_MSG:
            ui_enter_list(UI_MSGLIST, 0);
            break;
        case UI_ITEM_QUIET:
            /* The one row that acts without leaving the menu: the answer is the
               row's own label, which now says the other thing. A screen of its
               own would be a screen with one line on it.

               display_force, because ui_draw_list() returns early when the
               selection has not moved — and it has not: what changed is a
               string the cache still holds the old copy of. */
            ring_quiet_toggle();
            display_force = true;
            ui_draw();
            break;
        case UI_ITEM_BACKLIGHT:
            /* Acts without leaving the menu, exactly as Quiet does, and for the
               same reason: the answer is the row's own label, and a screen with
               one line on it would be a worse way to say it. The level is only
               recorded here — the pulse train that carries it out belongs to
               backlight_poll() on the next pass, so the redraw below happens
               while the panel is still at the old brightness and the new one
               arrives a few milliseconds later. That is the right order:
               brightness changing after the row that announced it reads as the
               row causing it. */
            backlight_menu_click();
            display_force = true;
            ui_draw();
            break;
        case UI_ITEM_DIM:
            /* The third row that acts in place, for the third time the same
               reason: two states, no arguments, and the answer is the row's
               own label — which is why display_force is needed here as it is
               for Quiet, since ui_draw_list() returns early on a selection
               that has not moved. The brightness itself does not change on
               this pass: the click has just stamped ui_last_input, so the
               policy is handing the level back either way, and the switch
               only decides what happens once the dim threshold passes. */
            backlight_idle_toggle();
            display_force = true;
            ui_draw();
            break;
        case UI_ITEM_TVBGONE:
            ui_enter_list(UI_TVMENU, UI_TV_ALL);
            break;
        case UI_ITEM_AP:
            /* The only route in on the device, and time-boxed: a session
               nobody reprovisions closes itself. It used to share the job with
               a three-second hold of the user key, which is now what walks the
               message stack — but this row was always the reliable one, and
               ap_start() has one more caller in wifi_setup(), which raises the
               AP at boot when the stored credentials do not connect. */
            if (!ap_active) ap_start(true);
            ui_enter(UI_AP);
            break;
        case UI_ITEM_INFO:
            ui_enter(UI_INFO);
            break;
        default:
            ui_enter(UI_CLOCK);
            break;
    }
}

/* One level up, landing on the item that leads back down. */
static void ui_back() {
    switch (ui_screen) {
        case UI_BRAND:   ui_enter_list(UI_TVMENU, UI_TV_BRAND);   break;
        case UI_TVMENU:  ui_enter_list(UI_MENU, UI_ITEM_TVBGONE); break;
        case UI_MSGLIST: ui_enter_list(UI_MENU, UI_ITEM_MSG);     break;
        default:         ui_enter(UI_CLOCK);                      break;
    }
}

