Awis13/seed/seeds/esp32-tembed/src/ui.h
static void ui_init() {
    /* GPIO0 is a strapping pin: it is only ever read, never driven. */
    pinMode(PIN_ENC_KEY, INPUT_PULLUP);
    /* Pull-ups before attaching: the library defaults to pull-DOWN, which
       leaves both channels floating against the encoder's common ground and
       makes the count wander with no error of any kind. */
    ESP32Encoder::useInternalWeakPullResistors = puType::up;
    /* Direction belongs to UI_ENCODER_DIRECTION, not to the pin order here. */
    ui_encoder.attachFullQuad(PIN_ENC_A, PIN_ENC_B);
    /* Hardware glitch filter, in APB (80MHz) cycles, 10 bits wide. attach()
       leaves it at 250 (~3.1us); 1023 is the register maximum and about
       12.8us, far below the shortest edge a hand can produce and well above
       contact bounce. The quadrature channels get this instead of a software
       time filter, which would drop real detents during a fast spin. */
    ui_encoder.setFilter(1023);
    ui_encoder.clearCount();
    ui_encoder_reset();
    /* A boot is input: the device came up because somebody pressed something or
       plugged it in, so the idle clock starts here rather than at zero. */
    ui_note_input();
}

/*
 * The two screens that must not be taken away from whoever is watching them.
 *
 * They are predicates rather than two locals inside ui_poll() because there is
 * a second consumer: the backlight's idle policy exempts exactly these, and it
 * has to exempt the SAME ones. A blast dimmed to nothing halfway through, or a
 * level meter that fades while a finger is still on the key, would be the same
 * defect the screen timeout was already written to avoid — and two copies of
 * this pair, thirty lines apart, is how they would come to disagree.
 *
 * A blast counts only while it is on the panel: one started over HTTP while a
 * menu is up is not live output the person in front of the device is watching,
 * and there is nothing on screen for the exemption to protect.
 */
static bool ui_watching_blast() { return ui_screen == UI_BLAST && ir_busy(); }

/* The recording screen is exempt outright rather than only while it records: a
   hold can outlast fifteen seconds of "no input" — holding a key is not input
   to the click state machine — and its own exit is deterministic, so neither
   the timeout nor the dimming has anything to add and both could only fire
   mid-sentence. */
static bool ui_watching_rec() { return ui_screen == UI_REC; }

/*
 * The progress bar, which is live output too — but only to the backlight, and
 * that asymmetry is the whole reason it is a third predicate rather than a
 * third case in the pair above.
 *
 * The screen timeout may fire under a bar and cost nothing: what it does is
 * return to the clock face, and the clock face is where the bar is drawn. Going
 * dark is not the same act. A job pushed with POST /progress — a backup script,
 * a long build, anything holding a percentage up on somebody's desk — has
 * nothing to do with the knob, so nothing stamps ui_last_input for it and the
 * panel it is drawn on would otherwise go out two minutes in.
 *
 * On the clock face only, for the same reason a blast counts only while it is
 * on the panel: a bar nobody can see is not output being protected. And bounded
 * without any help from here, because a job carries a deadline of its own — the
 * bar clears itself and the panel goes back to blanking on schedule.
 */
static bool ui_watching_progress() {
    return ui_screen == UI_CLOCK && progress_current(NULL);
}

/*
 * Hand the backlight policy the idle clock. Called from loop(), once a pass,
 * immediately above backlight_poll().
 *
 * NOT from inside ui_poll(), and the reason is worth stating because the
 * opposite looks obviously right: ui_poll() returns early from most paths, and
 * from the clock face it returns UNCONDITIONALLY — `case UI_CLOCK` has nothing
 * to time out to, so it answers the click and leaves. The clock face is where
 * this device spends its life, so a brightness decision made at the bottom of
 * ui_poll() would be a brightness decision that almost never runs. What IS
 * shared with the screen timeout is everything that matters: the one timestamp,
 * and the two exemptions it also has.
 *
 * That unconditional return is also why the thresholds mean exactly what they
 * say FROM THE CLOCK FACE. Elsewhere they are later, and by a knowable amount:
 * ui_enter() stamps the timestamp, so the automatic return to the clock at
 * UI_IDLE_MS restarts the dim clock once. Input on a menu therefore dims at
 * UI_IDLE_MS + BL_IDLE_DIM_MS and blanks at UI_IDLE_MS + BL_IDLE_OFF_MS — one
 * restart and not a repeating one, because from the clock face there is no
 * further timeout to stamp anything. Worth knowing before timing the device
 * with a stopwatch and concluding the thresholds are wrong.
 *
 * The subtraction is here, in the one place that owns ui_last_input, and it is
 * the unsigned form that survives the 49-day wrap of millis(). bl_idle_level()
 * is handed the elapsed time and no clocks at all.
 */
static void ui_backlight_idle() {
    /* The message card needs no exemption of its own, and this is why. A card
       is returned to the clock face after UI_IDLE_MS whether it was read or
       not, so with the dim threshold strictly longer than that, a card is
       never on the panel when the first dimming happens — there is no moment
       at which a notification could fade out from under somebody reading it.
       That is arithmetic between two constants in two files, so it is checked
       here rather than trusted: shortening either one below the other stops
       the build instead of quietly costing somebody a message. */
    static_assert(BL_IDLE_DIM_MS > UI_IDLE_MS,
                  "the backlight must not dim while a message card can still "
                  "be on the panel: BL_IDLE_DIM_MS must exceed UI_IDLE_MS");
    /* The fourth fact is not about a screen at all: an unread critical never
       expires, and blanking the panel would take away the breathing hairline
       that is the only sign of one left once the ring's night window has
       silenced the ring. skills/backlight.cpp turns that into a floor, not a
       wake-up. */
    BacklightPanel panel;
    panel.blasting = ui_watching_blast();
    panel.recording = ui_watching_rec();
    panel.on_bar = ui_watching_progress();
    panel.crit_unread = notify_crit_unread();
    backlight_idle(millis() - ui_last_input, panel);
}

/* A press that began on a panel the idle policy had blanked. Its whole job was
   to bring the light back, and the release that ends it must not also be read
   as a click — but by then the panel is lit, and lit by this very press, so
   there is nothing left at the release to tell the two apart. Hence a mark, set
   where the press starts and spent by the release it was set for. See the wake
   in ui_poll(), which is the only reader and the only writer. */
static bool ui_wake_press = false;

