Awis13/seed/seeds/esp32-tembed/src/ui.h
/* Called every loop() pass. Nothing here blocks and nothing here draws unless
   something actually changed. */
static void ui_poll() {
    int steps = ui_encoder_steps();
    ui_button_poll(ui_enc_key);
    ui_button_poll(ui_user_key);

    /* The encoder key's long hold belongs to the recording gesture in
       mic_key_poll(), so only a short press counts as a click here. Without
       this the release that ends a recording would ALSO open the menu from the
       clock, on top of stopping the take — the same trap the user key was
       already guarded against below, and for the same reason. */
    bool click = ui_enc_key.click && ui_enc_key.held_ms < MIC_HOLD_MS;
    /*
     * The user key's long hold walks the stack of messages behind the card,
     * which is the job the knob used to do before the knob became the way to
     * read a body longer than the card. It is a gesture on one screen only:
     * everywhere else a press of this key is "one level up" however long it
     * lasted, which is what it has always been, and confining the new meaning
     * to the card is what keeps a slow press on a menu from doing nothing at
     * all.
     *
     * The threshold is the one mic.cpp already uses for the encoder key's own
     * hold, so the device has one idea of how long a hold is rather than two.
     * It is not the three seconds the retired AP gesture used: that was long on
     * purpose, because it authorised provisioning, and walking a stack does not.
     *
     * `back` discards the release that ends the hold, the way it discarded the
     * one that ended the AP gesture — a hold produces a click on release like
     * any other press, and without this a long hold would both walk the stack
     * and leave the card.
     *
     * What `back` no longer does is throw away a slow press. It used to be
     * `click && held_ms < AP_KEY_HOLD_MS`, which meant a press of three seconds
     * or more did nothing at all on ANY screen: the filter was there to stop the
     * AP gesture's release from stepping up a level as well, and with the
     * gesture gone it protected nothing. So the device-wide consequence of that
     * one line is that a slow press is now one level up everywhere, which is
     * what this key means and what somebody leaning on it expects. The card is
     * the only screen that reads the length of a press at all, and it reads it
     * through `card_hold`.
     */
    bool card_hold = ui_user_key.click && ui_screen == UI_MSGCARD &&
                     ui_user_key.held_ms >= MSG_STACK_HOLD_MS;
    bool back = ui_user_key.click && !card_hold;

    /*
     * The release of a press whose card went away underneath it. It is not a
     * step up and it is not a walk of the stack: it is the end of a gesture
     * whose subject no longer exists. See ui_drop_user_click.
     *
     * First of the three rules that follow, and the order between them is the
     * whole of why they agree. This is the only one that decides what a press
     * MEANT, so it runs before anything reads that meaning. It also has to run
     * on every pass that carries the release, whatever else is true of that
     * pass: the flag is cleared by the very release it was set for, and a pass
     * that skipped it would leave it standing over somebody else's click.
     */
    if (ui_user_key.click && ui_drop_user_click) {
        ui_drop_user_click = false;
        card_hold = false;
        back = false;
    }

    /*
     * A key that is DOWN is input, and nothing above can see it: ui_button_poll()
     * reports a click on RELEASE only, so a press that has not been let go of
     * yet produces no steps, no click and no back at all. Three decisions turn
     * on that — whether this pass belongs to somebody already touching the
     * device, whether the device has been idle, and whether a panel that is lit
     * was lit by the press still being held — and the first two were wrong for
     * the whole length of every hold without it.
     */
    bool key_down = ui_user_key.level || ui_enc_key.level;

    /*
     * Any click of either key, whatever it was read as — including the one
     * discarded just above, which is still a hand on the device — and a key
     * still down, which is a hand on it too.
     *
     * Second, and deliberately above the wake rather than below it: a press
     * that does nothing but bring the light back is still somebody standing at
     * the device, and a wake that did not restart the idle clock would dim
     * again under the hand it had just answered. ui_note_input() is the one
     * writer of the timestamp, and this condition is the whole of what
     * ui_poll() calls input.
     */
    if (steps != 0 || click || ui_user_key.click || key_down) ui_note_input();

    /*
     * Last: a press on a panel the policy has blanked wakes it and does nothing
     * else.
     *
     * Before there was a dark state every press was deliberate, because there
     * was always something on the screen to press AT. Now the first press is
     * usually somebody wanting to see the time — and on the clock face a click
     * opens the menu, so without this they get the menu instead. That is how
     * every phone and every watch behaves and the opposite is a surprise every
     * single time.
     *
     * Only while it was BLANK. A press on a merely dimmed panel is a press on a
     * screen its owner can read, and swallowing that would be taking away a
     * click they meant. backlight_blanked() answers the narrow question — dark
     * because of the policy, which a press undoes — and not "dark", which on a
     * device somebody set to level 0 by hand a press does not.
     *
     * The recording gesture is untouched and must stay so: a hold is not a
     * glance. mic_key_poll() reads it off the pin level from loop() and never
     * through the click state machine, and the MIC_HOLD_MS guard above already
     * keeps its release out of `click` — so a hold on the encoder still starts
     * a take from a dark panel, and nothing here decides anything about it.
     *
     * ui_wake_press is what the key-down rule above costs, and it is not
     * optional. A key that is DOWN now stamps input, so the panel is already
     * lit again by the time the release that carries the click arrives:
     * backlight_blanked() is false on the one pass that has something to
     * swallow, and every press would reach the screen behind the dark exactly
     * as if none of this were here. So the press is marked where it starts, on
     * the pass the panel was still blank, and the release is read against the
     * mark rather than against a panel it lit itself. A detent needs no mark:
     * the knob reports a turn on the pass it happens, while the panel is still
     * dark. Nothing else can arrive with the panel blank AND a key down —
     * a held key stamps every pass, so a panel cannot blank underneath one.
     *
     * card_hold is discarded with the other two and cannot currently arise: the
     * card has no exemption from the screen timeout, which fires at UI_IDLE_MS
     * against a blank at BL_IDLE_OFF_MS, so a blank panel is a panel that went
     * back to the clock face long ago. It is written down because it is one of
     * the three things a press is read as here, and a rule that covers two of
     * them is a rule waiting on somebody giving the card an exemption.
     */
    bool blanked = backlight_blanked();
    if (blanked && key_down) ui_wake_press = true;

    if (blanked && steps != 0) steps = 0;
    if (ui_wake_press) {
        click = false;
        card_hold = false;
        back = false;
    }
    /* Spent: either the release it was set for has just been discarded, or the
       press ended without ever producing one. */
    if (!key_down) ui_wake_press = false;

    /* The knob's own feedback on the ring, which outranks whatever the ring was
       saying by itself: a hand is on the control. The screen and the ring get
       the same detents, and neither is told what the other did with them.
       Below the wake, deliberately: the detent that brings the panel back is
       spent on bringing it back, and lighting an arc for a turn that moved
       nothing would be the same surprise in a different colour. */
    ring_knob(steps);

