Awis13/seed/seeds/esp32-tembed/src/ui.h
    /*
     * A recording takes the panel, from any screen and without being asked.
     *
     * It outranks everything else here for the same reason a running blast
     * does: it is live output, and there is no point in a level meter you
     * cannot see. It is also the only feedback that says the hold registered
     * at all — mic.cpp decides that on its own, off the pin level, and this is
     * how the UI finds out. Nothing below can take the screen back while a
     * take runs: the arrival branch only fires on the clock face, and the case
     * for UI_REC ignores input entirely.
     */
    if (mic_is_recording() && ui_screen != UI_REC) {
        ui_rec_done_at = 0;
        ui_enter(UI_REC);
        return;
    }

    /*
     * A message that arrives while the device is sitting on its clock puts
     * itself in front — that is the whole job. It does not take a screen away
     * from somebody using one: the unread badge and the Messages list are how
     * it gets noticed then. Either way the flag is consumed on the pass it
     * arrives, so a card can never appear fifteen seconds later when the idle
     * timer happens to land. And it yields to a hand already on the device: a
     * pass carrying input is that user's pass.
     *
     * A key merely still DOWN counts as that input, which is why `key_down` is
     * here and not only the clicks. A press begun on the clock — where a press
     * of the user key has always meant nothing — carries no click until it is
     * released, so without this the card would open UNDER a press that started
     * before it existed, and the release would then be answering a card the
     * presser never saw: at MSG_STACK_HOLD_MS it walks straight past the
     * arrival, leaving the message unread.
     *
     * That does defer the flag rather than consume it, for as long as the key
     * is held. It is the one way the paragraph above is not quite exact, and
     * the bound is the length of a press and not the idle timer: the pass after
     * the release picks the arrival up, on whatever screen that release left.
     *
     * `card_hold` is deliberately not named here. It can only be true on the
     * card and this branch only fires on the clock, so listing it would read as
     * a case that can arise; `key_down` is what covers the press it is made of.
     */
    if (steps == 0 && !click && !back && !key_down) {
        uint32_t arrived = 0;
        if (notify_take_arrival(&arrived) && arrived != 0 &&
            ui_screen == UI_CLOCK) {
            ui_sel = 0;
            ui_first = 0;
            ui_enter_card(arrived);
            return;
        }
    }

    switch (ui_screen) {
        case UI_CLOCK:
            if (click) {
                ui_enter_list(UI_MENU, 0);
            } else if (steps != 0) {
                ui_panel_sel = UI_PANEL_NONE;
                ui_panel_key[0] = '\0';
                ui_panel_move(steps);
                ui_enter(UI_PANEL);
            }
            return;

        case UI_PANEL:
            if (click || back) {
                ui_enter(UI_CLOCK);
                return;
            }
            if (steps != 0) {
                ui_panel_move(steps);
                ui_draw();
            }
            break;

        case UI_MENU:
        case UI_TVMENU:
        case UI_BRAND:
        case UI_MSGLIST: {
            if (back) { ui_back(); return; }
            if (steps != 0) {
                int count = ui_list_count();
                ui_sel += steps;
                /* Wrap rather than clamp: a knob with no end stops, so running
                   off one end should arrive at the other. */
                ui_sel %= count;
                if (ui_sel < 0) ui_sel += count;
                ui_draw();
            }
            if (click) { ui_activate(ui_sel); return; }
            break;
        }

        case UI_MSGCARD: {
            int idx = notify_index_of(ui_msg_id);
            /* Expired or evicted out from under the card. */
            if (idx < 0) {
                /* A hold that is still down has just lost what it was a hold
                   ON, and its release is still to come. Mark it so that the
                   list this drops to does not read that release as a second
                   step up on top of the one being taken here. */
                if (ui_user_key.level) ui_drop_user_click = true;
                ui_enter_list(UI_MSGLIST, 0);
                return;
            }

            /* What the message carries is what decides what the knob does, and
               it is read on the pass that carries the input rather than kept
               across passes: a count cached at entry is a count that can no
               longer be checked against the entry being answered.
               notify_view_by_id() is the lookup ui_draw_card() draws with and
               stops at the same first id match, so the row on screen and the
               row being answered cannot be different rows. */
            NotifyView v;
            uint8_t opts = 0;
            bool have = (click || card_hold || steps != 0) &&
                        notify_view_by_id(ui_msg_id, v, NULL, NULL);
            if (have) opts = v.opt_count;

            /* A long press moves to the next card in the stack. It wraps, and
               the text below does not: this one is browsing, which is what a
               ring of cards is for, and the body is reading, which has a first
               line and a last one.
               It is answered BEFORE the click, because the two keys can be let
               go on the same pass and only one of them can be obeyed: this is
               the deliberate one, seven hundred milliseconds of it, and the
               click is what a hand resting on the device produces by accident. */
            if (card_hold) {
                int count = notify_count();
                if (count > 1) {
                    int n = (idx + 1) % count;
                    /* Its own name: `v` above is the card on screen, this is
                       the neighbour being stepped to, and they are two
                       different messages. */
                    NotifyView next;
                    /* Re-fade on the way in, so moving through the stack reads
                       as one card replacing another rather than as text
                       changing inside a frame that never moved. */
                    if (notify_view(n, next)) { ui_sel = n; ui_enter_card(next.id); return; }
                }
                /* Nowhere to go on a stack of one, and going nowhere is better
                   than re-opening the same card: that would drop the reader
                   back at the first line of what they were reading. Falling
                   through rather than breaking, because a detent that arrived on
                   the same pass is still a detent, and this hold did nothing
                   with it. */
            }

            /* A click is "I have seen this" — or, when ui_chip_answers() says
               this one is an answer, the answer, which is stronger:
               notify_choose_id() marks it read as part of recording the choice.
               Everything else falls through to the plain acknowledgement,
               including a click on a card that asks something nobody has
               scrolled far enough to reach. ui_chip_clamp() is what keeps a
               selection restored from a `chosen` the store no longer has
               options for from being handed over as an answer. A short press
               of the user key is the same plain step up it is on every other
               screen and leaves the message unread, and its question
               unanswered, on purpose. */
            if (click) {
                if (ui_chip_answers(ui_chip_sel, opts)) {
                    notify_choose_id(ui_msg_id,
                                     (uint8_t)ui_chip_clamp(ui_chip_sel, opts));
                } else {
                    notify_ack_id(ui_msg_id);
                }
                ui_enter_list(UI_MSGLIST, idx);
                return;
            }
            if (back) { ui_enter_list(UI_MSGLIST, idx); return; }

            if (steps != 0 && have) {
                /* The wrap is normally already done — entering the card drew
                   it — but the position the detent moves is read from it, so
                   the input asks for it by name rather than assuming the draw
                   ran first. */
                ui_card_wrap(v);
                UiCardPos pos = { ui_card_first, ui_chip_sel };
                pos = ui_card_step(pos, steps, ui_card_max_first(), (int)opts);
                if (pos.first != ui_card_first || pos.chip != ui_chip_sel) {
                    ui_card_first = pos.first;
                    ui_chip_sel = pos.chip;
                    ui_draw();
                }
            }
            break;
        }

        case UI_BLAST: {
            /* A click stops the job; the screen stays until it has actually
               wound down, then shows how it ended for a moment. Either way it
               goes back to the list the job was started from. */
            if (click) ir_stop_job();
            if (back) {
                ir_stop_job();
                ui_enter_list(ui_blast_back, ui_blast_back_sel);
                return;
            }
            if (ir_busy()) {
                ui_blast_done_at = 0;
            } else if (ui_blast_done_at == 0) {
                ui_blast_done_at = millis();
            } else if (millis() - ui_blast_done_at >= UI_RESULT_MS) {
                ui_enter_list(ui_blast_back, ui_blast_back_sel);
                return;
            }
            break;
        }

        case UI_REC:
            /* Input is not how this screen ends. The release of the very key
               that started the take is what stops it, and mic_key_poll() has
               already acted on that release by the time ui_poll() runs — so
               there is nothing here to react to, and reacting would mean
               reacting twice. The click that release produced was suppressed
               above by the MIC_HOLD_MS guard in any case. */
            if (mic_is_recording()) {
                ui_rec_done_at = 0;
                break;
            }
            /* The take is over: hold the result up long enough to read the
               peak, then go home. Signed, and against a fresh reading, as
               everything in this firmware that subtracts clocks now is. */
            if (ui_rec_done_at == 0) {
                ui_rec_done_at = millis();
            } else if ((long)(millis() - ui_rec_done_at) >= (long)UI_REC_RESULT_MS) {
                ui_enter(UI_CLOCK);
                return;
            }
            break;

        case UI_AP:
        case UI_INFO:
            if (click || back) {
                ui_enter_list(UI_MENU,
                              ui_screen == UI_AP ? UI_ITEM_AP : UI_ITEM_INFO);
                return;
            }
            break;
    }

