Awis13/seed/seeds/esp32-tembed/src/ui.h
    /* Live output must not be timed out from under the user; everything else
       falls back to the clock except a panel page, whose explicit way home is
       either button. Unlike the two live-output exemptions above, UI_PANEL is
       intentionally absent from ui_backlight_idle(): its page stays selected
       while the ordinary policy is free to dim or blank the display.

       The card is the other screen where holding a key is normal, and it gets
       no exemption on purpose — it is where an unread message sits, and a card
       that never times out is a card left on the panel of a device nobody is
       standing at. What it needed instead was for a hold to count as input,
       which is what `key_down` above does. Before that, a hold outlasting
       UI_IDLE_MS let this fire mid-gesture: the card went back to the clock,
       and the release then arrived there as a plain `back` on a screen that
       ignores it, so the whole gesture was swallowed. */
    if (!ui_watching_blast() && !ui_watching_rec() && ui_screen != UI_PANEL &&
        millis() - ui_last_input >= UI_IDLE_MS) {
        ui_enter(UI_CLOCK);
        return;
    }

    /* The card runs at the fade rate only while it is actually fading — three
       frames — and drops back to the ordinary tick the moment it has settled. */
    unsigned long interval =
        (ui_screen == UI_MSGCARD && ui_card_fade < MSG_FADE_STEPS)
            ? MSG_FADE_MS : UI_TICK_MS;

    if (millis() - ui_last_draw >= interval) {
        ui_last_draw = millis();
        if (!ui_input_driven(ui_screen)) ui_draw();
    }
}
